In [7]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame
from numpy import nan as NA

In [2]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
# The built-in Python None value is also treated as NA in object arrays:
string_data[0] = None;
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
data=Series([1,NA, 3.5, NA, 7])

In [9]:
data.dropna() # filtering out missing data

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
# in DF .dropna() by default drops any row containing a missing value:
data=DataFrame([[1, 6.5, 3], [1, NA, NA], [NA,NA,NA], [NA, 6.5, 3]]);
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
cleaned=data.dropna();
cleaned

     0    1    2
0  1.0  6.5  3.0

In [17]:
cleaned2=data.dropna(how='all'); #drops only the rows with all NaN
cleaned2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
data[3]=NA;# adding col of  all NA
data

     0    1    2   3
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
data.dropna(axis=1, how='all') # droping NA from cols

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [22]:
df=DataFrame(np.random.randn(7,3));
df

          0         1         2
0  0.722126 -0.075402 -0.032725
1  0.413573 -0.614677  0.806384
2  0.638077 -1.504631  0.159643
3  0.823853  1.635817 -0.305591
4  0.300659 -0.236766  0.422810
5 -0.030803 -0.763131  0.903198
6  0.451423  1.587825 -0.504976

In [23]:
df.ix[:4,1]=NA; 
df.ix[:2,2]=NA;
df

          0         1         2
0  0.722126       NaN       NaN
1  0.413573       NaN       NaN
2  0.638077       NaN       NaN
3  0.823853       NaN -0.305591
4  0.300659       NaN  0.422810
5 -0.030803 -0.763131  0.903198
6  0.451423  1.587825 -0.504976

In [24]:
# keep only rows containing a certain number of observations
df.dropna(thresh=2)

          0         1         2
3  0.823853       NaN -0.305591
4  0.300659       NaN  0.422810
5 -0.030803 -0.763131  0.903198
6  0.451423  1.587825 -0.504976

In [25]:
df.dropna(thresh=3)

          0         1         2
5 -0.030803 -0.763131  0.903198
6  0.451423  1.587825 -0.504976

In [ ]:
# Filling in Missing Data:

In [26]:
df

          0         1         2
0  0.722126       NaN       NaN
1  0.413573       NaN       NaN
2  0.638077       NaN       NaN
3  0.823853       NaN -0.305591
4  0.300659       NaN  0.422810
5 -0.030803 -0.763131  0.903198
6  0.451423  1.587825 -0.504976

In [30]:
df.fillna(0, inplace=True); # inplace=True for permanent change
df

          0         1         2
0  0.722126  0.000000  0.000000
1  0.413573  0.000000  0.000000
2  0.638077  0.000000  0.000000
3  0.823853  0.000000 -0.305591
4  0.300659  0.000000  0.422810
5 -0.030803 -0.763131  0.903198
6  0.451423  1.587825 -0.504976